import { useState } from 'react';

// 아이디 생성 조건이 있습니다. 아래 조건을 실시간으로 검색하여 
// 조건에 부합하면 '생성할 수 있는 아이디 입니다.'라고 출력을
// 만약 부합하지 않는다면 '생성할 수 없는 아이디 입니다.'라고 출력을 합니다.
// onChange 이벤트를 활용하여 만들어 봅시다. 그리고 함수를 따로 만들어주세요.

// 조건 1: 아이디는 6자 이상이어야 합니다.
// 조건 2: 아이디는 영어 소문자, 숫자만 사용할 수 있습니다.
// 조건 3: 아이디는 공백이 포함될 수 없습니다.

function App() {
    return (
        <>
            <h2>회원가입</h2>
            <input
                type="text"
                placeholder="아이디를 입력하세요"
                onChange={(e) => {
                }}
            />
            <p>아이디 생성 조건</p>
            <ul>
                <li>조건 1: 아이디는 6자 이상이어야 합니다.</li>
                <li>조건 2: 아이디는 영어 소문자, 숫자만 사용할 수 있습니다.</li>
                <li>조건 3: 아이디는 공백이 포함될 수 없습니다.</li>
            </ul>
        </>
    )
}

export default App
